username = input('username : ') 
password = input('password : ') 

if username=='jamemassem' and password=='123456789': 
    print('--------------------Welcome to 4AM Book Store--------------------') 

    print('''
    โปรโมชั่นวันนี้ลด 50% !!! รายการหนังสือที่ลดมีดังนี้ 
    1. ตะลุยโจทย์ Python 1000 ข้อ            -  350 ฿ (จากปกติ 700 ฿)
    2. ยอดนักสืบจิ๋วโคนัน ตอนที่ 1091           -  129 ฿ (จากปกติ 258 ฿)
    3. สาวขี้อายกับชายหน้ามึน                  -  124 ฿ (จากปกติ 249 ฿)
    4. คู่มือธรรมะกระตุกจิตกระชากใจเพื่อบรรลุธรรม   -  150 ฿ (จากปกติ 300 ฿)
    5. ภาษาไทยโดนใจวัยเรียน              -  195 ฿ (จากปกติ 390 ฿)''') 
    print()
    print('-----------------------------------------------------------------') 
    print()
    choice = int(input('โปรดกรอกตัวเลขรายการหนังสือที่คุณต้องการสั่งซื้อ : '))
    amount = int(input('โปรดกรอกจำนวนสินค้า : '))
    if choice==1: 
        totalprice=350*amount 
        print('-----------------------------------------------------------------')
        print(f'หนังสือ ตะลุยโจทย์ Python 1000 ข้อ    X{amount}  :  {totalprice} ฿')
        print('-----------------------------------------------------------------')
        print('Thank you !!! : 4AM Book Store')
        print('-----------------------------------------------------------------')
    elif choice==2: 
        totalprice=129*amount 
        print('-----------------------------------------------------------------')
        print(f'หนังสือมังงะ ยอดนักสืบจิ๋วโคนัน ตอนที่ 1091    X{amount}  :  {totalprice} ฿')
        print('-----------------------------------------------------------------')
        print('Thank you !!! : 4AM Book Store')
        print('-----------------------------------------------------------------')
    elif choice==3: 
        totalprice=124*amount 
        print('-----------------------------------------------------------------')
        print(f'นวนิยายเรื่อง สาวขี้อายกับชายหน้ามึน    X{amount}  :  {totalprice} ฿')
        print('-----------------------------------------------------------------')
        print('Thank you !!! : 4AM Book Store')
        print('-----------------------------------------------------------------')
    elif choice==4: 
        totalprice=150*amount 
        print('-----------------------------------------------------------------')
        print(f'หนังสือคู่มือธรรมะกระตุกจิตกระชากใจเพื่อบรรลุธรรม    X{amount}  :  {totalprice} ฿')
        print('-----------------------------------------------------------------')
        print('Thank you !!! : 4AM Book Store')
        print('-----------------------------------------------------------------')
    elif choice==5: 
        totalprice=195*amount 
        print('-----------------------------------------------------------------')
        print(f'หนังสือภาษาไทยโดนใจวัยเรียน    X{amount}  :  {totalprice} ฿')
        print('-----------------------------------------------------------------')
        print('Thank you !!! : 4AM Book Store')
        print('-----------------------------------------------------------------') 
    else: 
        print('ขออภัยไม่มีสินค้าที่คุณต้องการสั่งซื้อ') 
else: 
    print('username หรือ password ของคุณไม่ถูกต้อง')